// - ให้สร้างฟังก์ชันเช็คตัวเลขว่าเป็นจำนวนเฉพาะหรือไม่
// - ให้สร้างฟังก์ชันรับรับพารามิเตอร์เป็นตัวเลข และแสดงตัวเลขจำนวนเฉพาะทั้งหมดตั้งแต่ 2 ถึงตัวเลขที่รับมาเป็นพารามิเตอร์

let primeBank = " 1 , 2 , 3 , 5 , 7 ,  ";

function primeNum (num) {

    for (i=1 ; i <= num ; i++) {

        if (i !== 1) {
            if (i % 2 !== 0) {
                if (i % 3 !== 0) {
                    if (i % 5 !== 0) {
                        if (i % 7 !== 0) {
                            
                            primeBank += i;
                            primeBank += " , "
                            
    
                        }
                    }
                }
            }
        }
    } console.log(primeBank)
} 

primeNum(150);





